/* 
    Задание 1:

    Вывести в консоль с помощью цикла FOR все четные числа от 10 до 50
*/

for(let a = 10; a <= 50; a++){
    if(a % 2 == 0){
        console.log(a)
    }
}

/* 
    Задание 2:

    Необходимо создать объект в котором вы опишите самого себя в формате : "свойство: значение"

    Список свойств:

    - Имя(string)
    - Фамилия(string)
    - Возраст(number)
    - Есть ли домашние животные(boolean)
*/
let Student = {
    name: "Valentina",
    surname: "Tihonska",
    Age: 20,
    "Have a pet": false
}
/* 
    Задание 3:

    Отрывок из текста А.С Пушкин, Капитанская дочка был разбит на небольшие кусочки и помещен в массив. 
    Необходимо собрать этот текст из массива и придать ему первоначальный вид.

    Текст до разбивки на части:

    "В ту же ночь приехал я в Симбирск, где должен был пробыть сутки для закупки нужных вещей,
    что и было поручено Савельичу. Я остановился в трактире. Савельич с утра отправился по лавкам"

    Массив: 
    const array = [
        'я в Симбирск,',
        'в трактире.',
        'с утра',
        'В ту же ночь',
        'Я остановился',
        'для закупки', 
        'что и было поручено Савельичу.',
        'приехал,',
        'где должен был',
        'нужных вещей',
        'отправился по лавкам',
        'пробыть сутки',
        'Савельич'
    ]

   итоговый текст должен быть собран из массива array и результат записать в переменную result
*/

    const array = [
        'я в Симбирск,',
        'в трактире.',
        'с утра',
        'В ту же ночь',
        'Я остановился',
        'для закупки', 
        'что и было поручено Савельичу.',
        'приехал',
        'где должен был',
        'нужных вещей',
        'отправился по лавкам',
        'пробыть сутки',
        'Савельич'
    ]

    array[0] = 'В ту же ночь';
    array[1] = 'приехал';
    array[2] = 'я в Симбирск,';
    array[3] = 'где должен был';
    array[4] = 'пробыть сутки';
    array[5] = 'для закупки';
    array[6] = 'нужных вещей';
    array[7] = 'что и было поручено Савельичу.';
    array[8] = 'Я остановился';
    array[9] = 'в трактире.';
    array[10] = 'Савельич';
    array[11] = 'с утра';
    array[12] = 'отправился по лавкам';
    const result = [array];
    for(i = 0; i <= 12; i++){
        console.log(result[i])
    }

/* 
    Задание 4:

    Напишите функцию, в теле которой будет находится следующий код:

    const fullName = `${firstName} ${lastName}`;
    console.log(fullName);

    firstName и lastName - это параметры функции

    При вызове функции передайте ей, в качестве аргумента, свое имя и фамилию.
*/
 function showName(firstName, lastName){
    const fullName = `${firstName} ${lastName}`;
    console.log(fullName);
 }

 showName('Valentina', 'Tihonska');
/* 
    Задание 5:

    Вывести в консоль с помощью цикла WHILE все нечетные числа от 21 до 67
    
*/
let b = 21;
while(b <= 67){
    if(b % 2){
        console.log(b);
    }
    b++;
}